In [1]:
import pandas as pd

In [2]:
DBsVan = pd.read_csv('../../data/clean/vancouver_db.csv')
DBsScores = pd.read_csv('../../data/score_sets/all_destination_scores.csv')

In [3]:
DBsVan.head()

            id pop      lat       lon
0  59150004004  35  49.3739 -123.2738
1  59150004005  50  49.3746 -123.2757
2  59150004006  94  49.3738 -123.2763
3  59150004011   0  49.3735 -123.2725
4  59150004012   0  49.3725 -123.2729

In [8]:
DBsScores.head()

        fromId     score
0  59150004004  0.409541
1  59150004005  0.404883
2  59150004006  0.404903
3  59150004011  0.406174
4  59150004012  0.403910

In [12]:
DBsVanScores = pd.merge(DBsVan, DBsScores, left_on="id", right_on="fromId")
DBsVanScores.drop("fromId", inplace = True, axis = 1)

In [13]:
DBsVanScores.head()

            id pop      lat       lon     score
0  59150004004  35  49.3739 -123.2738  0.409541
1  59150004005  50  49.3746 -123.2757  0.404883
2  59150004006  94  49.3738 -123.2763  0.404903
3  59150004011   0  49.3735 -123.2725  0.406174
4  59150004012   0  49.3725 -123.2729  0.403910

In [15]:
DBsVanScores.to_csv('../../data/score_sets/vancouver_db_details.csv', index=False)